In [3]:
import pandas as pd

In [8]:
countries = pd.Series(['Polska', 'Francja', 'Niemcy'], 
                      index=['PL', 'FR', 'DE'])
countries

PL     Polska
FR    Francja
DE     Niemcy
dtype: object

In [9]:
type(countries.values), countries.values

(numpy.ndarray, array(['Polska', 'Francja', 'Niemcy'], dtype=object))

In [10]:
countries.iloc[0]

'Polska'

In [12]:
countries.loc['PL']

'Polska'

In [21]:
df = pd.read_csv('emps.csv', sep=';', parse_dates=['hire_date'])
df

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
0,100,Steven,King,President,24000,1997-06-17,Executive,2004 Charade Rd,98199,Seattle,United States of America
1,101,Neena,Kochhar,Administration Vice President,17000,1999-09-21,Executive,2004 Charade Rd,98199,Seattle,United States of America
2,102,Lex,De Haan,Administration Vice President,17000,2003-01-13,Executive,2004 Charade Rd,98199,Seattle,United States of America
3,103,Alexander,Hunold,Programmer,9000,2000-01-03,IT,2014 Jabberwocky Rd,26192,Southlake,United States of America
4,104,Bruce,Ernst,Programmer,6000,2001-05-21,IT,2014 Jabberwocky Rd,26192,Southlake,United States of America
...,...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,Marketing Representative,6000,2007-08-17,Marketing,147 Spadina Ave,M5V 2L7,Toronto,Canada
103,203,Susan,Mavris,Human Resources Representative,6500,2004-06-07,Human Resources,8204 Arthur St,NaN,London,United Kingdom
104,204,Hermann,Baer,Public Relations Representative,10000,2004-06-07,Public Relations,Schwanthalerstr. 7031,80925,Munich,Germany
105,205,Shelley,Higgins,Accounting Manager,12000,2004-06-07,Accounting,2004 Charade Rd,98199,Seattle,United States of America
106,206,William,Gietz,Public Accountant,8300,2004-06-07,Accounting,2004 Charade Rd,98199,Seattle,United States of America

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   employee_id      107 non-null    int64
 1   first_name       107 non-null    object
 2   last_name        107 non-null    object
 3   job_title        107 non-null    object
 4   salary           107 non-null    int64
 5   hire_date        107 non-null    datetime64[ns]
 6   department_name  106 non-null    object
 7   address          106 non-null    object
 8   postal_code      105 non-null    object
 9   city             106 non-null    object
 10  country          106 non-null    object
dtypes: datetime64[ns](1), int64(2), object(8)
memory usage: 9.3+ KB

In [25]:
df.describe(include='all')

/var/folders/__/0gvd5dsj22b9cbv4hzvln3pw0000gn/T/ipykernel_22191/2884002236.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df.describe(include='all')

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
count,107.000000,107,107,107,107.000000,107,106,106,105,106,106
unique,NaN,91,102,19,NaN,99,11,7,6,7,4
top,NaN,Peter,King,Sales Representative,NaN,2004-06-07 00:00:00,Shipping,2011 Interiors Blvd,99236,South San Francisco,United States of America
freq,NaN,3,2,30,NaN,4,45,45,45,45,68
first,NaN,NaN,NaN,NaN,NaN,1987-09-17 00:00:00,NaN,NaN,NaN,NaN,NaN
last,NaN,NaN,NaN,NaN,NaN,2011-02-06 00:00:00,NaN,NaN,NaN,NaN,NaN
mean,153.000000,NaN,NaN,NaN,6461.682243,NaN,NaN,NaN,NaN,NaN,NaN
std,31.032241,NaN,NaN,NaN,3909.365746,NaN,NaN,NaN,NaN,NaN,NaN
min,100.000000,NaN,NaN,NaN,2100.000000,NaN,NaN,NaN,NaN,NaN,NaN
25%,126.500000,NaN,NaN,NaN,3100.000000,NaN,NaN,NaN,NaN,NaN,NaN
50%,153.000000,NaN,NaN,NaN,6200.000000,NaN,NaN,NaN,NaN,NaN,NaN
75%,179.500000,NaN,NaN,NaN,8900.000000,NaN,NaN,NaN,NaN,NaN,NaN
max,206.000000,NaN,NaN,NaN,24000.000000,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
for row_id, emp in df.iterrows():
    print(row_id, emp['first_name'])

0 Steven
1 Neena
2 Lex
3 Alexander
4 Bruce
5 David
6 Valli
7 Diana
8 Nancy
9 Daniel
10 John
11 Ismael
12 Jose Manuel
13 Luis
14 Den
15 Alexander
16 Shelli
17 Sigal
18 Guy
19 Karen
20 Matthew
21 Adam
22 Payam
23 Shanta
24 Kevin
25 Julia
26 Irene
27 James
28 Steven
29 Laura
30 Mozhe
31 James
32 TJ
33 Jason
34 Michael
35 Ki
36 Hazel
37 Renske
38 Stephen
39 John
40 Joshua
41 Trenna
42 Curtis
43 Randall
44 Peter
45 John
46 Karen
47 Alberto
48 Gerald
49 Eleni
50 Peter
51 David
52 Peter
53 Christopher
54 Nanette
55 Oliver
56 Janette
57 Patrick
58 Allan
59 Lindsey
60 Louise
61 Sarath
62 Clara
63 Danielle
64 Mattea
65 David
66 Sundar
67 Amit
68 Lisa
69 Harrison
70 Tayler
71 William
72 Elizabeth
73 Sundita
74 Ellen
75 Alyssa
76 Jonathon
77 Jack
78 Kimberely
79 Charles
80 Winston
81 Jean
82 Martha
83 Girard
84 Nandita
85 Alexis
86 Julia
87 Anthony
88 Kelly
89 Jennifer
90 Timothy
91 Randall
92 Sarah
93 Britney
94 Samuel
95 Vance
96 Alana
97 Kevin
98 Donald
99 Douglas
100 Jennifer
101 Michael
102 Pat
103 Susan
104 Hermann
105 Shelley
106 William

In [31]:
df['city'] == 'Oxford'

0      False
1      False
2      False
3      False
4      False
       ...
102    False
103    False
104    False
105    False
106    False
Name: city, Length: 107, dtype: bool

In [32]:
df[df['city'] == 'Oxford']

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
45,145,John,Russell,Sales Manager,14000,2006-10-01,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
46,146,Karen,Partners,Sales Manager,13500,2007-01-05,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
47,147,Alberto,Errazuriz,Sales Manager,12000,2007-03-10,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
48,148,Gerald,Cambrault,Sales Manager,11000,2009-10-15,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
49,149,Eleni,Zlotkey,Sales Manager,10500,2000-01-29,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
50,150,Peter,Tucker,Sales Representative,10000,2007-01-30,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
51,151,David,Bernstein,Sales Representative,9500,2007-03-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
52,152,Peter,Hall,Sales Representative,9000,2007-08-20,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
53,153,Christopher,Olsen,Sales Representative,8000,2008-03-30,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
54,154,Nanette,Cambrault,Sales Representative,7500,2008-12-09,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
55,155,Oliver,Tuvault,Sales Representative,7000,2009-11-23,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
56,156,Janette,King,Sales Representative,10000,2006-01-30,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
57,157,Patrick,Sully,Sales Representative,9500,2006-03-04,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
58,158,Allan,McEwen,Sales Representative,9000,2006-08-01,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
59,159,Lindsey,Smith,Sales Representative,8000,2007-03-10,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
60,160,Louise,Doran,Sales Representative,7500,2007-12-15,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
61,161,Sarath,Sewall,Sales Representative,7000,2008-11-03,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
62,162,Clara,Vishney,Sales Representative,10500,2007-11-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
63,163,Danielle,Greene,Sales Representative,9500,2009-03-19,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
64,164,Mattea,Marvins,Sales Representative,7200,2010-01-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
65,165,David,Lee,Sales Representative,6800,2000-02-23,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
66,166,Sundar,Ande,Sales Representative,6400,2000-03-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
67,167,Amit,Banda,Sales Representative,6200,2000-04-21,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
68,168,Lisa,Ozer,Sales Representative,11500,2007-03-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
69,169,Harrison,Bloom,Sales Representative,10000,2008-03-23,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
70,170,Tayler,Fox,Sales Representative,9600,2008-01-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
71,171,William,Smith,Sales Representative,7400,2009-02-23,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
72,172,Elizabeth,Bates,Sales Representative,7300,2009-03-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
73,173,Sundita,Kumar,Sales Representative,6100,2010-04-21,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
74,174,Ellen,Abel,Sales Representative,11000,2006-05-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
75,175,Alyssa,Hutton,Sales Representative,8800,2007-03-19,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
76,176,Jonathon,Taylor,Sales Representative,8600,2008-03-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
77,177,Jack,Livingston,Sales Representative,8400,2008-04-23,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
79,179,Charles,Johnson,Sales Representative,6200,2011-01-04,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom

In [34]:
df.query('city == "Oxford" and salary > 10000')

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
45,145,John,Russell,Sales Manager,14000,2006-10-01,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
46,146,Karen,Partners,Sales Manager,13500,2007-01-05,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
47,147,Alberto,Errazuriz,Sales Manager,12000,2007-03-10,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
48,148,Gerald,Cambrault,Sales Manager,11000,2009-10-15,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
49,149,Eleni,Zlotkey,Sales Manager,10500,2000-01-29,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
62,162,Clara,Vishney,Sales Representative,10500,2007-11-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
68,168,Lisa,Ozer,Sales Representative,11500,2007-03-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
74,174,Ellen,Abel,Sales Representative,11000,2006-05-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom

In [36]:
my_city = 'Oxford'
df.query('city == @my_city and salary > 10000')

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
45,145,John,Russell,Sales Manager,14000,2006-10-01,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
46,146,Karen,Partners,Sales Manager,13500,2007-01-05,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
47,147,Alberto,Errazuriz,Sales Manager,12000,2007-03-10,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
48,148,Gerald,Cambrault,Sales Manager,11000,2009-10-15,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
49,149,Eleni,Zlotkey,Sales Manager,10500,2000-01-29,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
62,162,Clara,Vishney,Sales Representative,10500,2007-11-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
68,168,Lisa,Ozer,Sales Representative,11500,2007-03-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
74,174,Ellen,Abel,Sales Representative,11000,2006-05-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom

In [40]:
my_city = 'Oxford'
df.query(f'city == "{my_city}" and salary > 10000')

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
45,145,John,Russell,Sales Manager,14000,2006-10-01,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
46,146,Karen,Partners,Sales Manager,13500,2007-01-05,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
47,147,Alberto,Errazuriz,Sales Manager,12000,2007-03-10,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
48,148,Gerald,Cambrault,Sales Manager,11000,2009-10-15,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
49,149,Eleni,Zlotkey,Sales Manager,10500,2000-01-29,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
62,162,Clara,Vishney,Sales Representative,10500,2007-11-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
68,168,Lisa,Ozer,Sales Representative,11500,2007-03-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
74,174,Ellen,Abel,Sales Representative,11000,2006-05-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom

In [50]:
# https://towardsdatascience.com/pandas-dtype-specific-operations-accessors-c749bafb30a4
# https://pandas.pydata.org/docs/reference/api/pandas.Series.str.capitalize.html
df.first_name.str.upper()  # akcesor / accessor

0         STEVEN
1          NEENA
2            LEX
3      ALEXANDER
4          BRUCE
         ...
102          PAT
103        SUSAN
104      HERMANN
105      SHELLEY
106      WILLIAM
Name: first_name, Length: 107, dtype: object

In [47]:
# https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.date.html
df.hire_date.dt.year

0      1997
1      1999
2      2003
3      2000
4      2001
       ...
102    2007
103    2004
104    2004
105    2004
106    2004
Name: hire_date, Length: 107, dtype: int64

In [55]:
# url = 'https://alx.piotr.gg/python/sales-records.csv'
df = pd.read_csv('../data/sales-records.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 14 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   Region          1000000 non-null  object
 1   Country         1000000 non-null  object
 2   Item Type       1000000 non-null  object
 3   Sales Channel   1000000 non-null  object
 4   Order Priority  1000000 non-null  object
 5   Order Date      1000000 non-null  object
 6   Order ID        1000000 non-null  int64
 7   Ship Date       1000000 non-null  object
 8   Units Sold      1000000 non-null  int64
 9   Unit Price      1000000 non-null  float64
 10  Unit Cost       1000000 non-null  float64
 11  Total Revenue   1000000 non-null  float64
 12  Total Cost      1000000 non-null  float64
 13  Total Profit    1000000 non-null  float64
dtypes: float64(5), int64(2), object(7)
memory usage: 106.8+ MB

In [57]:
df.memory_usage(deep=True)

Index                  128
Region            72845056
Country           65904370
Item Type         65583558
Sales Channel     63500249
Order Priority    58000000
Order Date        65936701
Order ID           8000000
Ship Date         65936993
Units Sold         8000000
Unit Price         8000000
Unit Cost          8000000
Total Revenue      8000000
Total Cost         8000000
Total Profit       8000000
dtype: int64

In [59]:
df.memory_usage(deep=True).sum() / 2**20

489.90922451019287

In [60]:
df.dtypes

Region             object
Country            object
Item Type          object
Sales Channel      object
Order Priority     object
Order Date         object
Order ID            int64
Ship Date          object
Units Sold          int64
Unit Price        float64
Unit Cost         float64
Total Revenue     float64
Total Cost        float64
Total Profit      float64
dtype: object

In [61]:
df['Units Sold'].describe()

count    1000000.000000
mean        4998.867302
std         2885.334142
min            1.000000
25%         2502.000000
50%         4998.000000
75%         7496.000000
max        10000.000000
Name: Units Sold, dtype: float64

In [66]:
df['Units Sold'] = df['Units Sold'].astype('uint16')
df['Units Sold']

0         1593
1         4611
2          360
3          562
4         3973
          ...
999995    3387
999996    4068
999997    5266
999998    8551
999999    7519
Name: Units Sold, Length: 1000000, dtype: uint16

In [70]:
pd.to_datetime(df['Order Date'], format='%m/%d/%Y', errors='coerce')

0        2012-07-27
1        2013-09-14
2        2015-05-15
3        2017-05-17
4        2016-10-26
            ...
999995   2010-11-06
999996   2015-01-12
999997   2011-10-25
999998   2010-10-31
999999   2015-03-17
Name: Order Date, Length: 1000000, dtype: datetime64[ns]

In [71]:
df['Order Priority'].unique()

array(['M', 'H', 'L', 'C'], dtype=object)

In [73]:
# https://pandas.pydata.org/docs/user_guide/categorical.html
df['Order Priority'].astype('category')

0         M
1         M
2         M
3         H
4         L
         ..
999995    L
999996    C
999997    M
999998    M
999999    C
Name: Order Priority, Length: 1000000, dtype: category
Categories (4, object): ['C', 'H', 'L', 'M']

In [74]:
df.columns

Index(['Region', 'Country', 'Item Type', 'Sales Channel', 'Order Priority',
       'Order Date', 'Order ID', 'Ship Date', 'Units Sold', 'Unit Price',
       'Unit Cost', 'Total Revenue', 'Total Cost', 'Total Profit'],
      dtype='object')

In [5]:
typy = {
    "Units Sold": 'int16',
    "Order ID": 'int32',
    "Unit Price":'float32',
    "Unit Cost": 'float32',
    "Region": 'category',
    "Country": 'category',
    "Item Type": 'category',
    "Sales Channel": 'category',
    "Order Priority": 'category',
}

In [78]:
df = pd.read_csv('../data/sales-records.csv',
                dtype=typy, 
                parse_dates=['Order Date', 'Ship Date'],
                infer_datetime_format=True)
df

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,South Africa,Fruits,Offline,M,2012-07-27,443368995,2012-07-28,1593,9.330000,6.920000,14862.69,11023.56,3839.13
1,Middle East and North Africa,Morocco,Clothes,Online,M,2013-09-14,667593514,2013-10-19,4611,109.279999,35.840000,503890.08,165258.24,338631.84
2,Australia and Oceania,Papua New Guinea,Meat,Offline,M,2015-05-15,940995585,2015-06-04,360,421.890015,364.690002,151880.40,131288.40,20592.00
3,Sub-Saharan Africa,Djibouti,Clothes,Offline,H,2017-05-17,880811536,2017-07-02,562,109.279999,35.840000,61415.36,20142.08,41273.28
4,Europe,Slovakia,Beverages,Offline,L,2016-10-26,174590194,2016-12-04,3973,47.450001,31.790001,188518.85,126301.67,62217.18
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
999995,Sub-Saharan Africa,Senegal,Baby Food,Offline,L,2010-11-06,575470578,2010-12-11,3387,255.279999,159.419998,864633.36,539955.54,324677.82
999996,Central America and the Caribbean,Panama,Office Supplies,Offline,C,2015-01-12,766942107,2015-03-01,4068,651.210022,524.960022,2649122.28,2135537.28,513585.00
999997,Europe,Norway,Office Supplies,Online,M,2011-10-25,685472047,2011-12-05,5266,651.210022,524.960022,3429271.86,2764439.36,664832.50
999998,Europe,Montenegro,Beverages,Offline,M,2010-10-31,946734225,2010-12-08,8551,47.450001,31.790001,405744.95,271836.29,133908.66
999999,Central America and the Caribbean,Nicaragua,Meat,Online,C,2015-03-17,886714971,2015-04-08,7519,421.890015,364.690002,3172190.91,2742104.11,430086.80

In [80]:
df.memory_usage(deep=True).sum() / 2**20

57.23851013183594

In [16]:
df = pd.DataFrame()
df_gen = pd.read_csv('../data/sales-records.csv', dtype=typy,
                     chunksize=5_000)
for chunk in df_gen:
    data = chunk.query('`Units Sold` >= 300 and `Units Sold` <= 1000')
    df = df.append(data)

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69740 entries, 2 to 999957
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Region          69740 non-null  category
 1   Country         69740 non-null  category
 2   Item Type       69740 non-null  category
 3   Sales Channel   69740 non-null  category
 4   Order Priority  69740 non-null  category
 5   Order Date      69740 non-null  object
 6   Order ID        69740 non-null  int32
 7   Ship Date       69740 non-null  object
 8   Units Sold      69740 non-null  int16
 9   Unit Price      69740 non-null  float32
 10  Unit Cost       69740 non-null  float32
 11  Total Revenue   69740 non-null  float64
 12  Total Cost      69740 non-null  float64
 13  Total Profit    69740 non-null  float64
dtypes: category(5), float32(2), float64(3), int16(1), int32(1), object(2)
memory usage: 4.5+ MB

In [17]:
df

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
2,Australia and Oceania,Papua New Guinea,Meat,Offline,M,5/15/2015,940995585,6/4/2015,360,421.890015,364.690002,151880.40,131288.40,20592.00
3,Sub-Saharan Africa,Djibouti,Clothes,Offline,H,5/17/2017,880811536,7/2/2017,562,109.279999,35.840000,61415.36,20142.08,41273.28
6,Sub-Saharan Africa,Seychelles,Beverages,Online,M,1/18/2013,425793445,2/16/2013,597,47.450001,31.790001,28327.65,18978.63,9349.02
8,Sub-Saharan Africa,Ghana,Office Supplies,Online,L,3/23/2017,601245963,4/15/2017,896,651.210022,524.960022,583484.16,470364.16,113120.00
15,Sub-Saharan Africa,Uganda,Personal Care,Online,M,6/19/2014,539471471,7/21/2014,451,81.730003,56.669998,36860.23,25558.17,11302.06
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
999914,Sub-Saharan Africa,The Gambia,Household,Online,H,10/3/2010,339319026,11/17/2010,895,668.270020,502.540009,598101.65,449773.30,148328.35
999938,Asia,Indonesia,Vegetables,Online,H,7/19/2011,784605205,9/6/2011,971,154.059998,90.930000,149592.26,88293.03,61299.23
999953,Sub-Saharan Africa,Nigeria,Cosmetics,Online,H,7/9/2010,544168984,7/24/2010,550,437.200012,263.329987,240460.00,144831.50,95628.50
999956,Central America and the Caribbean,Saint Lucia,Cosmetics,Offline,M,2/14/2013,908758437,2/28/2013,671,437.200012,263.329987,293361.20,176694.43,116666.77
999957,Central America and the Caribbean,Guatemala,Fruits,Online,C,2/6/2011,739287889,2/21/2011,570,9.330000,6.920000,5318.10,3944.40,1373.70

## Bamboo

Instalacja: https://docs.bamboolib.8080labs.com/documentation/how-tos/installation-and-setup/install-bamboolib

In [21]:
!/Users/gradzinski/opt/anaconda3/bin/python -m pip install bamboolib
!/Users/gradzinski/opt/anaconda3/bin/python -m bamboolib install_nbextensions
!/Users/gradzinski/opt/anaconda3/bin/python -m bamboolib install_labextensions

Requirement already satisfied: bamboolib in /Users/gradzinski/.local/lib/python3.9/site-packages (1.30.19)
Requirement already satisfied: ppscore<2.0.0,>=1.2.0 in /Users/gradzinski/.local/lib/python3.9/site-packages (from bamboolib) (1.3.0)
Requirement already satisfied: packaging>=19.2 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (21.0)
Requirement already satisfied: attrs>=20.3.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (21.2.0)
Requirement already satisfied: jedi<1.0.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (0.18.0)
Requirement already satisfied: plotly<6.0.0,>=4.9.0 in /Users/gradzinski/.local/lib/python3.9/site-packages (from bamboolib) (5.13.1)
Requirement already satisfied: statsmodels<1.0.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (0.12.2)
Requirement already satisfied: psutil<6,>=5.4.2 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (5.8.0)
Requirement already satisfied: ipyslickgrid==0.0.3 in /Users/gradzinski/.local/lib/python3.9/site-packages (from bamboolib) (0.0.3)
Requirement already satisfied: ipywidgets<8.0.0,>=7.6.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (7.6.5)
Requirement already satisfied: scikit-learn<2.0.0,>=0.20.2 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (0.24.2)
Requirement already satisfied: toml>=0.10.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (0.10.2)
Requirement already satisfied: pygments in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (2.10.0)
Requirement already satisfied: pandas<2.0.0,>=1.1.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (1.3.4)
Requirement already satisfied: cryptography>=2.6.1 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (3.4.8)
Requirement already satisfied: xlrd>=1.0.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bamboolib) (2.0.1)
Requirement already satisfied: notebook>=4.0.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipyslickgrid==0.0.3->bamboolib) (6.4.5)
Requirement already satisfied: cffi>=1.12 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from cryptography>=2.6.1->bamboolib) (1.14.6)
Requirement already satisfied: pycparser in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from cffi>=1.12->cryptography>=2.6.1->bamboolib) (2.20)
Requirement already satisfied: traitlets>=4.3.1 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipywidgets<8.0.0,>=7.6.0->bamboolib) (5.1.0)
Requirement already satisfied: jupyterlab-widgets>=1.0.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipywidgets<8.0.0,>=7.6.0->bamboolib) (1.0.0)
Requirement already satisfied: ipython-genutils~=0.2.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipywidgets<8.0.0,>=7.6.0->bamboolib) (0.2.0)
Requirement already satisfied: ipython>=4.0.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipywidgets<8.0.0,>=7.6.0->bamboolib) (7.29.0)
Requirement already satisfied: ipykernel>=4.5.1 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipywidgets<8.0.0,>=7.6.0->bamboolib) (6.4.1)
Requirement already satisfied: widgetsnbextension~=3.5.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipywidgets<8.0.0,>=7.6.0->bamboolib) (3.5.1)
Requirement already satisfied: nbformat>=4.2.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipywidgets<8.0.0,>=7.6.0->bamboolib) (5.1.3)
Requirement already satisfied: matplotlib-inline<0.2.0,>=0.1.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipykernel>=4.5.1->ipywidgets<8.0.0,>=7.6.0->bamboolib) (0.1.2)
Requirement already satisfied: tornado<7.0,>=4.2 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipykernel>=4.5.1->ipywidgets<8.0.0,>=7.6.0->bamboolib) (6.1)
Requirement already satisfied: jupyter-client<8.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipykernel>=4.5.1->ipywidgets<8.0.0,>=7.6.0->bamboolib) (6.1.12)
Requirement already satisfied: debugpy<2.0,>=1.0.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipykernel>=4.5.1->ipywidgets<8.0.0,>=7.6.0->bamboolib) (1.4.1)
Requirement already satisfied: appnope in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipykernel>=4.5.1->ipywidgets<8.0.0,>=7.6.0->bamboolib) (0.1.2)
Requirement already satisfied: decorator in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipython>=4.0.0->ipywidgets<8.0.0,>=7.6.0->bamboolib) (5.1.0)
Requirement already satisfied: backcall in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipython>=4.0.0->ipywidgets<8.0.0,>=7.6.0->bamboolib) (0.2.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipython>=4.0.0->ipywidgets<8.0.0,>=7.6.0->bamboolib) (3.0.20)
Requirement already satisfied: pexpect>4.3 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipython>=4.0.0->ipywidgets<8.0.0,>=7.6.0->bamboolib) (4.8.0)
Requirement already satisfied: setuptools>=18.5 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipython>=4.0.0->ipywidgets<8.0.0,>=7.6.0->bamboolib) (58.0.4)
Requirement already satisfied: pickleshare in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from ipython>=4.0.0->ipywidgets<8.0.0,>=7.6.0->bamboolib) (0.7.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from jedi<1.0.0->bamboolib) (0.8.2)
Requirement already satisfied: python-dateutil>=2.1 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from jupyter-client<8.0->ipykernel>=4.5.1->ipywidgets<8.0.0,>=7.6.0->bamboolib) (2.8.2)
Requirement already satisfied: jupyter-core>=4.6.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from jupyter-client<8.0->ipykernel>=4.5.1->ipywidgets<8.0.0,>=7.6.0->bamboolib) (4.8.1)
Requirement already satisfied: pyzmq>=13 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from jupyter-client<8.0->ipykernel>=4.5.1->ipywidgets<8.0.0,>=7.6.0->bamboolib) (22.2.1)
Requirement already satisfied: jsonschema!=2.5.0,>=2.4 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from nbformat>=4.2.0->ipywidgets<8.0.0,>=7.6.0->bamboolib) (3.2.0)
Requirement already satisfied: pyrsistent>=0.14.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.2.0->ipywidgets<8.0.0,>=7.6.0->bamboolib) (0.18.0)
Requirement already satisfied: six>=1.11.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.2.0->ipywidgets<8.0.0,>=7.6.0->bamboolib) (1.16.0)
Requirement already satisfied: Send2Trash>=1.5.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (1.8.0)
Requirement already satisfied: argon2-cffi in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (20.1.0)
Requirement already satisfied: prometheus-client in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (0.11.0)
Requirement already satisfied: nbconvert in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (6.1.0)
Requirement already satisfied: terminado>=0.8.3 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (0.9.4)
Requirement already satisfied: jinja2 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (2.11.3)
Requirement already satisfied: pyparsing>=2.0.2 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from packaging>=19.2->bamboolib) (3.0.4)

Requirement already satisfied: pytz>=2017.3 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from pandas<2.0.0,>=1.1.0->bamboolib) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from pandas<2.0.0,>=1.1.0->bamboolib) (1.20.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from pexpect>4.3->ipython>=4.0.0->ipywidgets<8.0.0,>=7.6.0->bamboolib) (0.7.0)
Requirement already satisfied: tenacity>=6.2.0 in /Users/gradzinski/.local/lib/python3.9/site-packages (from plotly<6.0.0,>=4.9.0->bamboolib) (8.2.2)
Requirement already satisfied: wcwidth in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=4.0.0->ipywidgets<8.0.0,>=7.6.0->bamboolib) (0.2.5)
Requirement already satisfied: scipy>=0.19.1 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from scikit-learn<2.0.0,>=0.20.2->bamboolib) (1.7.1)
Requirement already satisfied: threadpoolctl>=2.0.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from scikit-learn<2.0.0,>=0.20.2->bamboolib) (2.2.0)
Requirement already satisfied: joblib>=0.11 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from scikit-learn<2.0.0,>=0.20.2->bamboolib) (1.1.0)
Requirement already satisfied: patsy>=0.5 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from statsmodels<1.0.0->bamboolib) (0.5.2)
Requirement already satisfied: MarkupSafe>=0.23 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from jinja2->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (1.1.1)
Requirement already satisfied: nbclient<0.6.0,>=0.5.0 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from nbconvert->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (0.5.3)
Requirement already satisfied: mistune<2,>=0.8.1 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from nbconvert->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (0.8.4)
Requirement already satisfied: bleach in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from nbconvert->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (4.0.0)
Requirement already satisfied: defusedxml in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from nbconvert->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (0.7.1)
Requirement already satisfied: pandocfilters>=1.4.1 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from nbconvert->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (1.4.3)
Requirement already satisfied: entrypoints>=0.2.2 in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from nbconvert->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (0.3)
Requirement already satisfied: testpath in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from nbconvert->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (0.5.0)
Requirement already satisfied: jupyterlab-pygments in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from nbconvert->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (0.1.2)
Requirement already satisfied: async-generator in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from nbclient<0.6.0,>=0.5.0->nbconvert->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (1.10)
Requirement already satisfied: nest-asyncio in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from nbclient<0.6.0,>=0.5.0->nbconvert->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (1.5.1)
Requirement already satisfied: webencodings in /Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages (from bleach->nbconvert->notebook>=4.0.0->ipyslickgrid==0.0.3->bamboolib) (0.5.1)
Trying to install bamboolib nbextension...
Traceback (most recent call last):
  File "/Users/gradzinski/opt/anaconda3/lib/python3.9/runpy.py", line 197, in _run_module_as_main
    return _run_code(code, main_globals, None,
  File "/Users/gradzinski/opt/anaconda3/lib/python3.9/runpy.py", line 87, in _run_code
    exec(code, run_globals)
  File "/Users/gradzinski/.local/lib/python3.9/site-packages/bamboolib/__main__.py", line 38, in <module>
    install_nbextensions()
  File "/Users/gradzinski/.local/lib/python3.9/site-packages/bamboolib/setup/_extensions.py", line 42, in install_nbextensions
    nbextensions.install_nbextension_python(extension, user=True)
  File "/Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages/notebook/nbextensions.py", line 203, in install_nbextension_python
    m, nbexts = _get_nbextension_metadata(module)
  File "/Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages/notebook/nbextensions.py", line 1114, in _get_nbextension_metadata
    m = import_item(module)
  File "/Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages/traitlets/utils/importstring.py", line 38, in import_item
    return __import__(parts[0])
ModuleNotFoundError: No module named 'plotlywidget'
Trying to install bamboolib labextensions...
Installing ipyslickgrid: ... Traceback (most recent call last):
  File "/Users/gradzinski/opt/anaconda3/lib/python3.9/runpy.py", line 197, in _run_module_as_main
    return _run_code(code, main_globals, None,
  File "/Users/gradzinski/opt/anaconda3/lib/python3.9/runpy.py", line 87, in _run_code
    exec(code, run_globals)
  File "/Users/gradzinski/.local/lib/python3.9/site-packages/bamboolib/__main__.py", line 40, in <module>
    install_labextensions()
  File "/Users/gradzinski/.local/lib/python3.9/site-packages/bamboolib/setup/_extensions.py", line 122, in install_labextensions
    commands.install_extension(extension)
  File "/Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages/jupyterlab/commands.py", line 409, in install_extension
    _node_check(app_options.logger)
  File "/Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages/jupyterlab/commands.py", line 1943, in _node_check
    node = which('node')
  File "/Users/gradzinski/opt/anaconda3/lib/python3.9/site-packages/jupyterlab_server/process.py", line 59, in which
    raise ValueError(msg)
ValueError: Please install Node.js and npm before continuing installation. You may be able to install Node.js from your package manager, from conda, or directly from the Node.js website (https://nodejs.org).

In [27]:
import bamboolib as bam

ModuleNotFoundError: No module named 'bamboolib'